sDassana/esp32-flight-controller/archive/legacy_versions/flight_controller.cpp
#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>
#include <ArduinoJson.h>
#include <ESP32Servo.h>
#include <Wire.h>
#include <SPI.h>
#include <RF24.h>
#include <Adafruit_MPU6050.h>
#include <Adafruit_BME280.h>
#include <BH1750.h>
#include <TinyGPS++.h>
#include "ScioSense_ENS160.h"
#include <Adafruit_AHTX0.h>
#include <Adafruit_Sensor.h>
#include <VL53L0X.h>

// PID Library
#include <PID_v1.h>

// FreeRTOS
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "freertos/queue.h"

// WiFi Credentials
const char *ssid = "Dialog 4G";       // Change this to your WiFi name
const char *password = "0N7NT00ANTQ"; // Change this to your WiFi password

// Web Server
WebServer server(80);

// Component Pins
#define NRF_CE_PIN 4
#define NRF_CSN_PIN 5
#define ESC1_PIN 13 // Front Right (CW)
#define ESC2_PIN 12 // Back Right (CCW)
#define ESC3_PIN 14 // Front Left (CCW)
#define ESC4_PIN 27 // Back Left (CW)
#define LED_R1_PIN 25
#define LED_G1_PIN 33
#define LED_B1_PIN 32
#define BUZZER_PIN 26
#define SDA_PIN 21
#define SCL_PIN 22
#define GUVA_PIN 36
#define GPS_RX_PIN 16
#define BATTERY_PIN 35

// Navigation LED Pins
#define NAV_FRONT_RIGHT_GREEN 32
#define NAV_BACK_RIGHT_GREEN 33
#define NAV_BACK_LEFT_RED 25
#define NAV_FRONT_CENTER_WHITE 17
#define NAV_FRONT_LEFT_RED 2
#define NAV_BACK_CENTER_WHITE 15

// PCA9548A I2C Multiplexer
#define PCA9548A_ADDR 0x70

// Control Loop Timing
#define CONTROL_LOOP_FREQUENCY 100                          // Hz
#define CONTROL_LOOP_PERIOD (1000 / CONTROL_LOOP_FREQUENCY) // ms

// Motor Limits
#define MOTOR_MIN 1000
#define MOTOR_MAX 2000
#define MOTOR_ARM_VALUE 1000
#define MOTOR_IDLE 1100
#define MOTOR_HOVER_ESTIMATE 1550 // Will be calibrated

// Component Objects
RF24 radio(NRF_CE_PIN, NRF_CSN_PIN);
Servo esc1, esc2, esc3, esc4;
Adafruit_MPU6050 mpu;
Adafruit_BME280 bme;
ScioSense_ENS160 ens160(ENS160_I2CADDR_1);
Adafruit_AHTX0 aht21;
BH1750 lightMeter;
TinyGPSPlus gps;

// ToF Sensors via PCA9548A
VL53L0X tof_front; // Channel 0
VL53L0X tof_right; // Channel 1
VL53L0X tof_back;  // Channel 2
VL53L0X tof_left;  // Channel 3

// FreeRTOS Handles
TaskHandle_t controlTaskHandle = NULL;
TaskHandle_t sensorTaskHandle = NULL;
TaskHandle_t telemetryTaskHandle = NULL;
SemaphoreHandle_t sensorMutex = NULL;
QueueHandle_t commandQueue = NULL;

// Flight Controller State
enum FlightMode
{
    MODE_DISARMED = 0,
    MODE_ARMED = 1,
    MODE_MANUAL = 2,
    MODE_STABILIZE = 3,
    MODE_ALTITUDE_HOLD = 4,
    MODE_POSITION_HOLD = 5,
    MODE_EMERGENCY = 6
};

struct FlightState
{
    FlightMode mode;
    bool motors_armed;
    bool emergency_stop;
    bool gps_available;
    bool altitude_hold_active;
    float hover_throttle;
    unsigned long last_command_time;
    unsigned long arm_time;
};

// Control Inputs (from WiFi dashboard or NRF24L01)
struct ControlInputs
{
    float throttle; // 0-1 (0 = motor_idle, 1 = motor_max)
    float roll;     // -1 to 1 (left/right)
    float pitch;    // -1 to 1 (forward/backward)
    float yaw;      // -1 to 1 (rotate left/right)
    bool arm_switch;
    bool mode_switch;
    unsigned long timestamp;
};

// Sensor Data Structure
struct SensorData
{
    // IMU Data
    float roll_angle;
    float pitch_angle;
    float yaw_angle;
    float roll_rate;
    float pitch_rate;
    float yaw_rate;
    float accel_x, accel_y, accel_z;

    // Altitude Data
    float altitude_baro;
    float altitude_gps;
    float altitude_filtered;
    float vertical_velocity;

    // Position Data (GPS)
    double latitude;
    double longitude;
    float ground_speed;
    int satellites;

    // Environmental
    float temperature;
    float humidity;
    float pressure;
    float air_quality_index;

    // Battery
    float battery_voltage;
    float battery_percentage;

    // System
    unsigned long timestamp;
    bool valid;
};

// PID Controllers
double rollSetpoint, rollInput, rollOutput;
double pitchSetpoint, pitchInput, pitchOutput;
double yawSetpoint, yawInput, yawOutput;
double altitudeSetpoint, altitudeInput, altitudeOutput;

// PID Parameters (will be tuned)
struct PIDParams
{
    double roll_kp, roll_ki, roll_kd;
    double pitch_kp, pitch_ki, pitch_kd;
    double yaw_kp, yaw_ki, yaw_kd;
    double altitude_kp, altitude_ki, altitude_kd;
};

// Initialize with refined conservative values for smooth flight
PIDParams pidParams = {
    // Roll PID - Reduced for smoother response
    .roll_kp = 1.5,  // Reduced from 2.0
    .roll_ki = 0.0,  // Keep at 0 initially
    .roll_kd = 0.08, // Slightly reduced from 0.1
    // Pitch PID - Reduced for smoother response
    .pitch_kp = 1.5,  // Reduced from 2.0
    .pitch_ki = 0.0,  // Keep at 0 initially
    .pitch_kd = 0.08, // Slightly reduced from 0.1
    // Yaw PID - Reduced for gentler yaw
    .yaw_kp = 0.8,  // Reduced from 1.0
    .yaw_ki = 0.0,  // Keep at 0 initially
    .yaw_kd = 0.03, // Slightly reduced from 0.05
    // Altitude PID
    .altitude_kp = 1.0,
    .altitude_ki = 0.0,
    .altitude_kd = 0.1};

// Create PID instances
PID rollPID(&rollInput, &rollOutput, &rollSetpoint, pidParams.roll_kp, pidParams.roll_ki, pidParams.roll_kd, DIRECT);
PID pitchPID(&pitchInput, &pitchOutput, &pitchSetpoint, pidParams.pitch_kp, pidParams.pitch_ki, pidParams.pitch_kd, DIRECT);
PID yawPID(&yawInput, &yawOutput, &yawSetpoint, pidParams.yaw_kp, pidParams.yaw_ki, pidParams.yaw_kd, DIRECT);
PID altitudePID(&altitudeInput, &altitudeOutput, &altitudeSetpoint, pidParams.altitude_kp, pidParams.altitude_ki, pidParams.altitude_kd, DIRECT);

// Global State Variables
FlightState flightState;
ControlInputs controlInputs;
SensorData sensorData;

// Motor outputs (PWM values)
struct MotorOutputs
{
    int motor1; // Front Right
    int motor2; // Back Right
    int motor3; // Front Left
    int motor4; // Back Left
};

MotorOutputs motorOutputs;

// Motor calibration offsets to compensate for mechanical imbalances
// Negative values reduce motor power, positive values increase it
struct MotorCalibration
{
    float motor1_offset; // Front Right
    float motor2_offset; // Back Right
    float motor3_offset; // Front Left (reduce if left side lifts early)
    float motor4_offset; // Back Left (reduce if left side lifts early)
};

