sDassana/esp32-flight-controller/archive/legacy_versions/flight_controller.cpp
// Initial calibration - reduce left motors since left side lifts early
MotorCalibration motorCal = {
    .motor1_offset = 0.0,   // Front Right - no change initially
    .motor2_offset = 0.0,   // Back Right - no change initially
    .motor3_offset = -15.0, // Front Left - reduce by 15 PWM units
    .motor4_offset = -15.0  // Back Left - reduce by 15 PWM units
};

// Function Declarations
void initializeHardware();
void initializePIDControllers();
void setupWebServer();
void connectWiFi();

// FreeRTOS Task Functions
void controlTask(void *parameter);
void sensorTask(void *parameter);
void telemetryTask(void *parameter);

// Core Flight Functions
void updateSensors();
void calculateOrientation();
void runPIDControllers();
void mixMotorOutputs();
void outputMotorCommands();
void checkSafetyConditions();
void handleEmergency();

// Utility Functions
float mapFloat(float x, float in_min, float in_max, float out_min, float out_max);
float constrainFloat(float value, float min_val, float max_val);
void updateFlightMode();
void calibrateIMU();

// LED Control Functions
void initializeLEDs();
void updateNavigationLights();
void updateStatusLights();
void setThrottlePulse(float throttle_percentage);

void setup()
{
    Serial.begin(115200);
    Serial.println("ESP32 Weather Drone Flight Controller Starting...");

    // Initialize hardware
    initializeHardware();

    // Initialize flight state
    flightState.mode = MODE_DISARMED;
    flightState.motors_armed = false;
    flightState.emergency_stop = false;
    flightState.gps_available = false;
    flightState.altitude_hold_active = false; // Ensure altitude hold starts disabled
    flightState.hover_throttle = MOTOR_HOVER_ESTIMATE;
    flightState.last_command_time = 0;
    flightState.arm_time = 0;

    // Initialize control inputs
    memset(&controlInputs, 0, sizeof(controlInputs));
    memset(&sensorData, 0, sizeof(sensorData));

    // Set initial sensor timestamp to prevent immediate emergency
    sensorData.timestamp = millis();

    // Give system 30 seconds startup grace period
    static unsigned long startup_time = millis(); // Initialize PID controllers
    initializePIDControllers();

    // Connect to WiFi
    connectWiFi();

    // Setup web server
    setupWebServer();

    // Create FreeRTOS synchronization primitives
    sensorMutex = xSemaphoreCreateMutex();
    commandQueue = xQueueCreate(10, sizeof(ControlInputs));

    // Create FreeRTOS tasks with larger stack sizes
    xTaskCreatePinnedToCore(
        controlTask,        // Function
        "Control Task",     // Name
        8192,               // Stack size (increased)
        NULL,               // Parameters
        3,                  // Priority (higher = more important)
        &controlTaskHandle, // Handle
        1                   // Core (0 or 1)
    );

    xTaskCreatePinnedToCore(
        sensorTask,        // Function
        "Sensor Task",     // Name
        8192,              // Stack size (increased)
        NULL,              // Parameters
        2,                 // Priority
        &sensorTaskHandle, // Handle
        0                  // Core
    );

    xTaskCreatePinnedToCore(
        telemetryTask,        // Function
        "Telemetry Task",     // Name
        4096,                 // Stack size (doubled)
        NULL,                 // Parameters
        1,                    // Priority
        &telemetryTaskHandle, // Handle
        0                     // Core
    );

    Serial.println("Flight Controller initialized successfully!");
    Serial.println("Starting control tasks...");
}

void loop()
{
    // Handle web server requests
    server.handleClient();

    // Main loop runs at lower priority - FreeRTOS handles the control loops
    delay(10);
}

void initializeHardware()
{
    // Initialize pins
    pinMode(LED_R1_PIN, OUTPUT);
    pinMode(LED_G1_PIN, OUTPUT);
    pinMode(LED_B1_PIN, OUTPUT);
    pinMode(BUZZER_PIN, OUTPUT);
    pinMode(GUVA_PIN, INPUT);
    pinMode(BATTERY_PIN, INPUT);

    // Initialize navigation LED pins
    initializeLEDs();

    // Set ADC attenuation for battery monitoring
    analogSetAttenuation(ADC_11db);

    // Initialize I2C
    Wire.begin(SDA_PIN, SCL_PIN);
    Wire.setClock(400000); // 400kHz for faster sensor reads

    // Initialize SPI for NRF24L01
    SPI.begin(18, 19, 23, 5);

    // Initialize MPU6050 IMU
    if (mpu.begin(0x68))
    {
        mpu.setAccelerometerRange(MPU6050_RANGE_8_G);
        mpu.setGyroRange(MPU6050_RANGE_500_DEG);
        mpu.setFilterBandwidth(MPU6050_BAND_21_HZ);
        Serial.println("MPU6050 initialized successfully");
    }
    else
    {
        Serial.println("ERROR: MPU6050 initialization failed!");
    }

    // Initialize BME280
    if (bme.begin(0x76) || bme.begin(0x77))
    {
        Serial.println("BME280 initialized successfully");
    }
    else
    {
        Serial.println("ERROR: BME280 initialization failed!");
    }

    // Initialize ESCs
    esc1.attach(ESC1_PIN, MOTOR_MIN, MOTOR_MAX);
    esc2.attach(ESC2_PIN, MOTOR_MIN, MOTOR_MAX);
    esc3.attach(ESC3_PIN, MOTOR_MIN, MOTOR_MAX);
    esc4.attach(ESC4_PIN, MOTOR_MIN, MOTOR_MAX);

    // Set motors to minimum (safety)
    esc1.writeMicroseconds(MOTOR_ARM_VALUE);
    esc2.writeMicroseconds(MOTOR_ARM_VALUE);
    esc3.writeMicroseconds(MOTOR_ARM_VALUE);
    esc4.writeMicroseconds(MOTOR_ARM_VALUE);

    Serial.println("Hardware initialization complete");

    // Brief startup sequence using navigation LEDs
    // Red LEDs first
    digitalWrite(NAV_BACK_LEFT_RED, HIGH);
    digitalWrite(NAV_FRONT_LEFT_RED, HIGH);
    delay(200);
    digitalWrite(NAV_BACK_LEFT_RED, LOW);
    digitalWrite(NAV_FRONT_LEFT_RED, LOW);

    // Green LEDs next
    digitalWrite(NAV_FRONT_RIGHT_GREEN, HIGH);
    digitalWrite(NAV_BACK_RIGHT_GREEN, HIGH);
    delay(200);

    // White center LEDs last
    digitalWrite(NAV_FRONT_CENTER_WHITE, HIGH);
    digitalWrite(NAV_BACK_CENTER_WHITE, HIGH);
    delay(200);
    digitalWrite(NAV_FRONT_CENTER_WHITE, LOW);
    digitalWrite(NAV_BACK_CENTER_WHITE, LOW);

    // Startup beep
    digitalWrite(BUZZER_PIN, HIGH);
    delay(150);
    digitalWrite(BUZZER_PIN, LOW);
}

void initializePIDControllers()
{
    // Configure Roll PID with very conservative limits
    rollPID.SetMode(AUTOMATIC);
    rollPID.SetOutputLimits(-200, 200); // Further reduced from ±300 to prevent saturation
    rollPID.SetSampleTime(CONTROL_LOOP_PERIOD);

    // Configure Pitch PID with very conservative limits
    pitchPID.SetMode(AUTOMATIC);
    pitchPID.SetOutputLimits(-200, 200); // Further reduced from ±300 to prevent saturation
    pitchPID.SetSampleTime(CONTROL_LOOP_PERIOD);

