sDassana/esp32-flight-controller/archive/legacy_versions/flight_controller.cpp
    // Configure Yaw PID with very conservative limits
    yawPID.SetMode(AUTOMATIC);
    yawPID.SetOutputLimits(-100, 100); // Further reduced from ±150 for gentle yaw
    yawPID.SetSampleTime(CONTROL_LOOP_PERIOD);

    // Configure Altitude PID
    altitudePID.SetMode(AUTOMATIC);
    altitudePID.SetOutputLimits(0, 1000); // Throttle addition
    altitudePID.SetSampleTime(CONTROL_LOOP_PERIOD);

    Serial.println("PID controllers initialized with very conservative limits");
}

void connectWiFi()
{
    WiFi.begin(ssid, password);
    Serial.print("Connecting to WiFi");

    int attempts = 0;
    while (WiFi.status() != WL_CONNECTED && attempts < 20)
    {
        delay(500);
        Serial.print(".");
        attempts++;
    }

    if (WiFi.status() == WL_CONNECTED)
    {
        Serial.println();
        Serial.print("WiFi connected! IP: ");
        Serial.println(WiFi.localIP());
    }
    else
    {
        Serial.println();
        Serial.println("WiFi connection failed!");
    }
}

// We'll continue with the task implementations in the next part...

// ================================
// FREERTOS TASK IMPLEMENTATIONS
// ================================

void controlTask(void *parameter)
{
    TickType_t xLastWakeTime = xTaskGetTickCount();
    const TickType_t xFrequency = pdMS_TO_TICKS(CONTROL_LOOP_PERIOD);

    Serial.println("Control Task started - Running at 100Hz");

    while (true)
    {
        // Wait for the next cycle
        vTaskDelayUntil(&xLastWakeTime, xFrequency);

        // Check safety conditions first
        checkSafetyConditions();

        if (flightState.emergency_stop)
        {
            handleEmergency();
            continue;
        }

        // Update flight mode based on inputs
        updateFlightMode();

        // Update LED status indicators
        updateStatusLights();
        updateNavigationLights();

        // Debug: Print control input status occasionally
        static int debug_counter = 0;
        if (++debug_counter >= 500)
        { // Every 5 seconds at 100Hz
            debug_counter = 0;
            Serial.printf("Control Debug - arm_switch: %s, mode_switch: %s, armed: %s\n",
                          controlInputs.arm_switch ? "true" : "false",
                          controlInputs.mode_switch ? "true" : "false",
                          flightState.motors_armed ? "true" : "false");

            // Show throttle and motor outputs when armed with detailed mapping
            if (flightState.motors_armed)
            {
                // Calculate what the base PWM should be for debug
                int expectedBasePWM = mapFloat(controlInputs.throttle, 0.0, 1.0, MOTOR_IDLE, MOTOR_MAX);
                Serial.printf("Throttle: %.2f%% -> Expected BasePWM: %d, Motors: [%d, %d, %d, %d]\n",
                              controlInputs.throttle * 100.0,
                              expectedBasePWM,
                              motorOutputs.motor1, motorOutputs.motor2,
                              motorOutputs.motor3, motorOutputs.motor4);
            }
        }

        // Only run control loops if armed and not in emergency
        if (flightState.motors_armed)
        {
            if (flightState.mode == MODE_MANUAL)
            {
                // Manual mode - direct throttle control without PID
                float baseThrottle = controlInputs.throttle;
                int basePWM = mapFloat(baseThrottle, 0.0, 1.0, MOTOR_IDLE, MOTOR_MAX);

                // All motors get same throttle in manual mode
                motorOutputs.motor1 = basePWM;
                motorOutputs.motor2 = basePWM;
                motorOutputs.motor3 = basePWM;
                motorOutputs.motor4 = basePWM;

                // Constrain all motor outputs to safe range
                motorOutputs.motor1 = constrain(motorOutputs.motor1, MOTOR_MIN, MOTOR_MAX);
                motorOutputs.motor2 = constrain(motorOutputs.motor2, MOTOR_MIN, MOTOR_MAX);
                motorOutputs.motor3 = constrain(motorOutputs.motor3, MOTOR_MIN, MOTOR_MAX);
                motorOutputs.motor4 = constrain(motorOutputs.motor4, MOTOR_MIN, MOTOR_MAX);

                // Output to motors
                outputMotorCommands();
            }
            else if (flightState.mode >= MODE_STABILIZE)
            {
                // Get latest sensor data (thread-safe)
                if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(5)) == pdTRUE)
                {
                    // Copy sensor data for control calculations
                    rollInput = sensorData.roll_angle;
                    pitchInput = sensorData.pitch_angle;
                    yawInput = sensorData.yaw_rate;
                    altitudeInput = sensorData.altitude_filtered;

                    xSemaphoreGive(sensorMutex);

                    // Run PID controllers
                    runPIDControllers();

                    // Mix motor outputs
                    mixMotorOutputs();

                    // Output to motors
                    outputMotorCommands();
                }
            }
        }
        else
        {
            // Motors disarmed - ensure all motors at idle
            motorOutputs.motor1 = MOTOR_ARM_VALUE;
            motorOutputs.motor2 = MOTOR_ARM_VALUE;
            motorOutputs.motor3 = MOTOR_ARM_VALUE;
            motorOutputs.motor4 = MOTOR_ARM_VALUE;
            outputMotorCommands();
        }
    }
}

void sensorTask(void *parameter)
{
    TickType_t xLastWakeTime = xTaskGetTickCount();
    const TickType_t xFrequency = pdMS_TO_TICKS(5); // 200Hz sensor reading

    Serial.println("Sensor Task started - Running at 200Hz");

    while (true)
    {
        vTaskDelayUntil(&xLastWakeTime, xFrequency);

        // Update all sensor readings
        updateSensors();

        // Calculate orientation from IMU
        calculateOrientation();

        // Update timestamp
        if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(2)) == pdTRUE)
        {
            sensorData.timestamp = millis();
            sensorData.valid = true;
            xSemaphoreGive(sensorMutex);
        }
    }
}

void telemetryTask(void *parameter)
{
    TickType_t xLastWakeTime = xTaskGetTickCount();
    const TickType_t xFrequency = pdMS_TO_TICKS(100); // 10Hz telemetry

    Serial.println("Telemetry Task started - Running at 10Hz");

    // Wait a few seconds before first status print
    vTaskDelay(pdMS_TO_TICKS(3000));
    Serial.println("=== FLIGHT CONTROLLER READY ===");
    Serial.printf("Web Dashboard: http://%s\n", WiFi.localIP().toString().c_str());
    Serial.println("Waiting for commands via web interface...");

    while (true)
    {
        vTaskDelayUntil(&xLastWakeTime, xFrequency);

        // Handle web server and telemetry
        // This will be expanded for NRF24L01 later

        // Print debug info every 5 seconds (reduce frequency further)
        static int counter = 0;
        if (++counter >= 50) // 5 seconds at 10Hz
        {
            counter = 0;

            if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(5)) == pdTRUE)
            {
                // Only print if we have valid sensor data
                if (sensorData.timestamp > 0)
                {
                    Serial.printf("Status - Mode: %d, Armed: %s, Roll: %.1f°, Pitch: %.1f°, Alt: %.1fm, Batt: %.1fV\n",
                                  flightState.mode,
                                  flightState.motors_armed ? "YES" : "NO",
                                  sensorData.roll_angle,
                                  sensorData.pitch_angle,
                                  sensorData.altitude_filtered,
                                  sensorData.battery_voltage);
                }
                xSemaphoreGive(sensorMutex);
            }
        }
    }
}

