sDassana/esp32-flight-controller/archive/legacy_versions/flight_controller.cpp
// ================================
// CORE FLIGHT CONTROL FUNCTIONS
// ================================

void updateSensors()
{
    static unsigned long lastBME280Read = 0;
    static unsigned long lastGPSRead = 0;
    static unsigned long lastBatteryRead = 0;

    // Read IMU data (high frequency)
    sensors_event_t accel, gyro, temp;
    bool imu_success = mpu.getEvent(&accel, &gyro, &temp);

    if (imu_success && xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(1)) == pdTRUE)
    {
        sensorData.accel_x = accel.acceleration.x;
        sensorData.accel_y = accel.acceleration.y;
        sensorData.accel_z = accel.acceleration.z;
        sensorData.roll_rate = gyro.gyro.x * 180.0 / PI; // Convert to degrees/sec
        sensorData.pitch_rate = gyro.gyro.y * 180.0 / PI;
        sensorData.yaw_rate = gyro.gyro.z * 180.0 / PI;
        xSemaphoreGive(sensorMutex);
    }

    // Read BME280 (lower frequency)
    if (millis() - lastBME280Read > 50)
    { // 20Hz
        lastBME280Read = millis();

        float pressure = bme.readPressure();
        if (!isnan(pressure) && pressure > 0)
        {
            if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(1)) == pdTRUE)
            {
                sensorData.pressure = pressure / 100.0;               // Convert to hPa
                sensorData.altitude_baro = bme.readAltitude(1013.25); // Sea level pressure
                sensorData.temperature = bme.readTemperature();
                sensorData.humidity = bme.readHumidity();
                xSemaphoreGive(sensorMutex);
            }
        }
    }

    // GPS reading disabled for now to prevent errors
    /*
    // Read GPS (lower frequency)
    if (millis() - lastGPSRead > 100)
    { // 10Hz
        lastGPSRead = millis();
        // GPS code commented out until Serial2 is properly initialized
    }
    */

    // Read battery (very low frequency)
    if (millis() - lastBatteryRead > 1000)
    { // 1Hz
        lastBatteryRead = millis();

        int rawValue = analogRead(BATTERY_PIN);
        float vOut = (rawValue / 4095.0) * 3.3;

        // For 3S LiPo battery reading - adjust voltage divider ratio
        // If no voltage divider is used, multiply by appropriate factor
        // Common voltage divider: R1=10k, R2=10k (divide by 2) = vOut * 2
        // For 3S LiPo (12.6V max): need divide by ~4, so vOut * 4
        // Empirical correction: 3.4V reading suggests vOut * 3.7 for 12.6V
        float batteryVoltage = vOut * 3.7; // Adjusted for actual hardware setup

        // Debug battery reading every 10 seconds
        static int battery_debug_counter = 0;
        if (++battery_debug_counter >= 10)
        {
            battery_debug_counter = 0;
            Serial.printf("Battery Debug - Raw ADC: %d, vOut: %.2f, Final: %.2f\n", rawValue, vOut, batteryVoltage);
        }

        if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(1)) == pdTRUE)
        {
            sensorData.battery_voltage = batteryVoltage;
            // Calculate percentage (3S LiPo: 9.0V-12.6V) - display only
            sensorData.battery_percentage = ((batteryVoltage - 9.0) / (12.6 - 9.0)) * 100.0;
            sensorData.battery_percentage = constrainFloat(sensorData.battery_percentage, 0.0, 100.0);
            xSemaphoreGive(sensorMutex);
        }
    }
}

void calculateOrientation()
{
    static float roll_angle = 0.0;
    static float pitch_angle = 0.0;
    static unsigned long lastUpdate = 0;

    unsigned long now = millis();
    float dt = (now - lastUpdate) / 1000.0; // Convert to seconds
    lastUpdate = now;

    if (dt > 0.1)
        dt = 0.1; // Limit dt to prevent large jumps

    // Get current sensor readings (thread-safe)
    float accel_x, accel_y, accel_z;
    float gyro_roll, gyro_pitch;

    if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(1)) == pdTRUE)
    {
        accel_x = sensorData.accel_x;
        accel_y = sensorData.accel_y;
        accel_z = sensorData.accel_z;
        gyro_roll = sensorData.roll_rate;
        gyro_pitch = sensorData.pitch_rate;
        xSemaphoreGive(sensorMutex);
    }
    else
    {
        return; // Skip this update if we can't get sensor data
    }

    // Calculate angles from accelerometer
    float accel_roll = atan2(accel_y, sqrt(accel_x * accel_x + accel_z * accel_z)) * 180.0 / PI;
    float accel_pitch = atan2(-accel_x, sqrt(accel_y * accel_y + accel_z * accel_z)) * 180.0 / PI;

    // Complementary filter (combine gyro and accel)
    const float alpha = 0.98; // Gyro weight (higher = trust gyro more)

    roll_angle = alpha * (roll_angle + gyro_roll * dt) + (1.0 - alpha) * accel_roll;
    pitch_angle = alpha * (pitch_angle + gyro_pitch * dt) + (1.0 - alpha) * accel_pitch;

    // Update global sensor data
    if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(1)) == pdTRUE)
    {
        sensorData.roll_angle = roll_angle;
        sensorData.pitch_angle = pitch_angle;

        // Simple altitude filtering (combine GPS and barometric)
        if (flightState.gps_available && sensorData.satellites >= 4)
        {
            // Use GPS altitude when available and reliable
            sensorData.altitude_filtered = sensorData.altitude_gps;
        }
        else
        {
            // Fall back to barometric altitude
            sensorData.altitude_filtered = sensorData.altitude_baro;
        }

        xSemaphoreGive(sensorMutex);
    }
}

void runPIDControllers()
{
    // Set setpoints based on control inputs and flight mode
    if (flightState.mode == MODE_STABILIZE)
    {
        // In stabilize mode, stick inputs set angle setpoints
        rollSetpoint = controlInputs.roll * 30.0;   // ±30 degrees max
        pitchSetpoint = controlInputs.pitch * 30.0; // ±30 degrees max
        yawSetpoint = controlInputs.yaw * 180.0;    // ±180 deg/sec max

        // DEBUG: Print throttle value being used
        static int throttle_debug_counter = 0;
        if (++throttle_debug_counter >= 500)
        { // Every 5 seconds
            throttle_debug_counter = 0;
            Serial.printf("PID Debug - controlInputs.throttle: %.3f\n", controlInputs.throttle);
        }
    }

    if (flightState.mode == MODE_ALTITUDE_HOLD && flightState.altitude_hold_active)
    {
        // Altitude hold mode - maintain current altitude
        // altitudeSetpoint is set when altitude hold is activated
    }

    // Run PID calculations
    bool rollComputed = rollPID.Compute();
    bool pitchComputed = pitchPID.Compute();
    bool yawComputed = yawPID.Compute();

    if (flightState.altitude_hold_active)
    {
        bool altComputed = altitudePID.Compute();
    }
}

void mixMotorOutputs()
{
    // Calculate base throttle
    float baseThrottle = controlInputs.throttle;

    // DEBUG: Track throttle value at start of mixing
    static int throttle_start_debug = 0;
    if (++throttle_start_debug >= 500)
    { // Every 5 seconds
        throttle_start_debug = 0;
        Serial.printf("Mix Start Debug - baseThrottle: %.3f\n", baseThrottle);
    }

    // In altitude hold mode, use PID output for throttle
    if (flightState.altitude_hold_active)
    {
        Serial.printf("ALTITUDE HOLD ACTIVE - Overriding throttle!\n");
        baseThrottle = mapFloat(altitudeOutput, 0, 1000, 0.0, 1.0);
        baseThrottle = constrainFloat(baseThrottle, 0.0, 1.0);
        Serial.printf("Altitude override - altitudeOutput: %.1f, new baseThrottle: %.3f\n", altitudeOutput, baseThrottle);
    }

    // Convert throttle to PWM range with better scaling
    // Map 0-100% throttle to 1100-2000 PWM for proper response

    // DEBUG: Check throttle value just before PWM calculation
    static int pre_pwm_debug = 0;
    if (++pre_pwm_debug >= 500)
    { // Every 5 seconds
        pre_pwm_debug = 0;
        if (flightState.motors_armed)
        {
            Serial.printf("PRE-PWM Debug - baseThrottle just before mapFloat: %.3f\n", baseThrottle);
        }
    }

    int basePWM = mapFloat(baseThrottle, 0.0, 1.0, MOTOR_IDLE, MOTOR_MAX);

    // DEBUG: Detailed PWM calculation tracking
    static int pwm_debug_counter = 0;
    if (++pwm_debug_counter >= 500)
    { // Every 5 seconds
        pwm_debug_counter = 0;
        if (flightState.motors_armed)
        {
            Serial.printf("PWM Calc Debug - Input: %.3f, MOTOR_IDLE: %d, MOTOR_MAX: %d, Result: %d\n",
                          baseThrottle, MOTOR_IDLE, MOTOR_MAX, basePWM);
            // Manual calculation check
            float manual_calc = baseThrottle * (MOTOR_MAX - MOTOR_IDLE) + MOTOR_IDLE;
            Serial.printf("Manual Calc Check - (%.3f * (%d - %d)) + %d = %.1f\n",
                          baseThrottle, MOTOR_MAX, MOTOR_IDLE, MOTOR_IDLE, manual_calc);
        }
    }

