sDassana/esp32-flight-controller/archive/legacy_versions/flight_controller.cpp
        Serial.println("Motors DISARMED");

        // Turn off center white LEDs when disarmed
        digitalWrite(NAV_FRONT_CENTER_WHITE, LOW);
        digitalWrite(NAV_BACK_CENTER_WHITE, LOW);
    }

    // Handle flight mode changes (when armed)
    if (flightState.motors_armed)
    {
        if (controlInputs.mode_switch)
        {
            flightState.mode = MODE_STABILIZE;
            Serial.println("Flight Mode: STABILIZE");
        }
        else
        {
            flightState.mode = MODE_MANUAL;
        }

        // Altitude hold activation disabled for testing
        // TODO: Implement proper altitude hold activation method (e.g., switch or button)
        /*
        // Altitude hold activation (example: holding yaw stick for 2 seconds)
        static unsigned long yaw_hold_start = 0;
        if (abs(controlInputs.yaw) < 0.1 && controlInputs.throttle > 0.3)
        {
            if (yaw_hold_start == 0)
            {
                yaw_hold_start = millis();
            }
            else if (millis() - yaw_hold_start > 2000)
            {
                flightState.altitude_hold_active = true;
                altitudeSetpoint = sensorData.altitude_filtered;
                Serial.println("Altitude Hold ACTIVATED");
                yaw_hold_start = 0;
            }
        }
        else
        {
            yaw_hold_start = 0;
            if (flightState.altitude_hold_active && abs(controlInputs.throttle) > 0.1)
            {
                flightState.altitude_hold_active = false;
                Serial.println("Altitude Hold DEACTIVATED");
            }
        }
        */
    }
}

// ================================
// UTILITY FUNCTIONS
// ================================

float mapFloat(float x, float in_min, float in_max, float out_min, float out_max)
{
    return (x - in_min) * (out_max - out_min) / (in_max - in_min) + out_min;
}

float constrainFloat(float value, float min_val, float max_val)
{
    if (value < min_val)
        return min_val;
    if (value > max_val)
        return max_val;
    return value;
}

// ================================
// WEB SERVER SETUP
// ================================

void setupWebServer()
{
    // Serve main dashboard
    server.on("/", HTTP_GET, []()
              {
        String html = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
    <title>ESP32 Drone Flight Controller</title>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <style>
        body { font-family: Arial, sans-serif; margin: 20px; background: #f0f0f0; }
        .container { max-width: 1200px; margin: 0 auto; }
        .card { background: white; padding: 20px; margin: 10px 0; border-radius: 8px; box-shadow: 0 2px 4px rgba(0,0,0,0.1); }
        .status { display: flex; flex-wrap: wrap; gap: 10px; }
        .status-item { padding: 10px; border-radius: 4px; color: white; min-width: 100px; text-align: center; }
        .status-armed { background: #4CAF50; }
        .status-disarmed { background: #f44336; }
        .status-manual { background: #ff9800; }
        .status-stabilize { background: #2196F3; }
        .controls { display: grid; grid-template-columns: repeat(auto-fit, minmax(300px, 1fr)); gap: 20px; }
        .joystick { text-align: center; padding: 20px; }
        button { padding: 10px 20px; margin: 5px; border: none; border-radius: 4px; cursor: pointer; }
        .btn-primary { background: #2196F3; color: white; }
        .btn-danger { background: #f44336; color: white; }
        .btn-success { background: #4CAF50; color: white; }
        input[type="range"] { width: 100%; }
        .sensor-grid { display: grid; grid-template-columns: repeat(auto-fit, minmax(200px, 1fr)); gap: 15px; }
        .sensor-value { padding: 10px; background: #e3f2fd; border-radius: 4px; text-align: center; }
        .emergency { background: #f44336; color: white; font-weight: bold; padding: 15px; border-radius: 8px; }
    </style>
</head>
<body>
    <div class="container">
        <h1>ESP32 Drone Flight Controller</h1>
        
        <!-- Flight Status -->
        <div class="card">
            <h2>Flight Status</h2>
            <div class="status" id="flightStatus">
                <div class="status-item status-disarmed">DISARMED</div>
                <div class="status-item">Manual Mode</div>
            </div>
            <div id="emergencyAlert" style="display: none;" class="emergency">
                WARNING: EMERGENCY MODE ACTIVE - LANDING AUTOMATICALLY
            </div>
        </div>
        
        <!-- Control Interface -->
        <div class="card">
            <h2>Flight Controls</h2>
            <div class="controls">
                <div class="joystick">
                    <h3>Throttle</h3>
                    <input type="range" id="throttle" min="0" max="100" value="0" orient="vertical" oninput="updateControl()">
                    <span id="throttle_val">0%</span>
                </div>
                <div class="joystick">
                    <h3>Roll (Left/Right)</h3>
                    <input type="range" id="roll" min="-100" max="100" value="0" oninput="updateControl()">
                    <span id="roll_val">0</span>
                </div>
                <div class="joystick">
                    <h3>Pitch (Forward/Back)</h3>
                    <input type="range" id="pitch" min="-100" max="100" value="0" oninput="updateControl()">
                    <span id="pitch_val">0</span>
                </div>
                <div class="joystick">
                    <h3>Yaw (Rotate)</h3>
                    <input type="range" id="yaw" min="-100" max="100" value="0" oninput="updateControl()">
                    <span id="yaw_val">0</span>
                </div>
            </div>
            <div style="text-align: center; margin-top: 20px;">
                <button class="btn-success" onclick="armMotors()">ARM MOTORS</button>
                <button class="btn-danger" onclick="disarmMotors()">DISARM MOTORS</button>
                <button class="btn-primary" onclick="toggleFlightMode()">TOGGLE MODE</button>
                <button class="btn-danger" onclick="emergencyStop()">EMERGENCY STOP</button>
            </div>
        </div>
        
        <!-- Sensor Data -->
        <div class="card">
            <h2>Live Sensor Data</h2>
            <div class="sensor-grid" id="sensorData">
                <div class="sensor-value">Roll: 0.0 deg</div>
                <div class="sensor-value">Pitch: 0.0 deg</div>
                <div class="sensor-value">Altitude: 0.0 m</div>
                <div class="sensor-value">Battery: 0.0V</div>
            </div>
        </div>
        
