sDassana/esp32-flight-controller/archive/legacy_versions/flight_controller.cpp
        <!-- Motor Calibration -->
        <div class="card">
            <h2>Motor Calibration (Fix Imbalance)</h2>
            <p style="color: #666; font-size: 14px;">Adjust motor offsets to compensate for mechanical imbalances. Negative values reduce motor power.</p>
            <div class="controls">
                <div>
                    <h3>Motor 1 (Front Right)</h3>
                    <label>Offset: <input type="number" id="motor1_offset" value="0" step="1" min="-50" max="50" onchange="updateMotorCal()"></label>
                </div>
                <div>
                    <h3>Motor 2 (Back Right)</h3>
                    <label>Offset: <input type="number" id="motor2_offset" value="0" step="1" min="-50" max="50" onchange="updateMotorCal()"></label>
                </div>
                <div>
                    <h3>Motor 3 (Front Left)</h3>
                    <label>Offset: <input type="number" id="motor3_offset" value="-15" step="1" min="-50" max="50" onchange="updateMotorCal()"></label>
                </div>
                <div>
                    <h3>Motor 4 (Back Left)</h3>
                    <label>Offset: <input type="number" id="motor4_offset" value="-15" step="1" min="-50" max="50" onchange="updateMotorCal()"></label>
                </div>
            </div>
            <div style="text-align: center; margin-top: 15px;">
                <button class="btn-primary" onclick="resetMotorCal()">Reset All to 0</button>
                <button class="btn-success" onclick="saveMotorCal()">Save Calibration</button>
            </div>
        </div>
        
        <!-- PID Tuning -->
        <div class="card">
            <h2>PID Tuning</h2>
            <div class="controls">
                <div>
                    <h3>Roll PID</h3>
                    <label>P: <input type="number" id="roll_p" value="2.0" step="0.1" onchange="updatePID()"></label><br>
                    <label>I: <input type="number" id="roll_i" value="0.0" step="0.01" onchange="updatePID()"></label><br>
                    <label>D: <input type="number" id="roll_d" value="0.1" step="0.01" onchange="updatePID()"></label><br>
                </div>
                <div>
                    <h3>Pitch PID</h3>
                    <label>P: <input type="number" id="pitch_p" value="2.0" step="0.1" onchange="updatePID()"></label><br>
                    <label>I: <input type="number" id="pitch_i" value="0.0" step="0.01" onchange="updatePID()"></label><br>
                    <label>D: <input type="number" id="pitch_d" value="0.1" step="0.01" onchange="updatePID()"></label><br>
                </div>
                <div>
                    <h3>Yaw PID</h3>
                    <label>P: <input type="number" id="yaw_p" value="1.0" step="0.1" onchange="updatePID()"></label><br>
                    <label>I: <input type="number" id="yaw_i" value="0.0" step="0.01" onchange="updatePID()"></label><br>
                    <label>D: <input type="number" id="yaw_d" value="0.05" step="0.01" onchange="updatePID()"></label><br>
                </div>
            </div>
        </div>
    </div>

    <script>
        let controlUpdateTimeout = null;
        let armed = false;
        let flightMode = 'MANUAL';
        
        // Update flight data every 100ms
        setInterval(updateFlightData, 100);
        
        // Send heartbeat control data every 500ms to prevent timeout
        setInterval(sendHeartbeat, 500);
        
        function sendHeartbeat() {
            // Only send heartbeat if armed
            if (armed) {
                const data = {
                    throttle: parseFloat(document.getElementById('throttle').value) / 100.0,
                    roll: parseFloat(document.getElementById('roll').value) / 100.0,
                    pitch: parseFloat(document.getElementById('pitch').value) / 100.0,
                    yaw: parseFloat(document.getElementById('yaw').value) / 100.0
                };
                
                fetch('/api/control', {
                    method: 'POST',
                    headers: {'Content-Type': 'application/json'},
                    body: JSON.stringify(data)
                });
            }
        }
        
        function updateFlightData() {
            fetch('/api/flight_data')
                .then(response => response.json())
                .then(data => {
                    updateFlightStatus(data.status);
                    updateSensorDisplay(data.sensors);
                })
                .catch(error => console.log('Data update error:', error));
        }
        
        function updateFlightStatus(status) {
            const container = document.getElementById('flightStatus');
            const emergency = document.getElementById('emergencyAlert');
            
            armed = status.armed;
            flightMode = status.mode;
            
            let statusClass = status.armed ? 'status-armed' : 'status-disarmed';
            let modeClass = status.mode === 'STABILIZE' ? 'status-stabilize' : 'status-manual';
            
            container.innerHTML = `
                <div class="status-item ${statusClass}">${status.armed ? '[ARMED]' : '[DISARMED]'}</div>
                <div class="status-item ${modeClass}">${status.mode} Mode</div>
                <div class="status-item">Alt Hold: ${status.altitude_hold ? 'ON' : 'OFF'}</div>
            `;
            
            if (status.emergency) {
                emergency.style.display = 'block';
            } else {
                emergency.style.display = 'none';
            }
        }
        
        function updateSensorDisplay(sensors) {
            const container = document.getElementById('sensorData');
            container.innerHTML = `
                <div class="sensor-value">Roll: ${sensors.roll.toFixed(1)} deg</div>
                <div class="sensor-value">Pitch: ${sensors.pitch.toFixed(1)} deg</div>
                <div class="sensor-value">Yaw Rate: ${sensors.yaw_rate.toFixed(1)} deg/s</div>
                <div class="sensor-value">Altitude: ${sensors.altitude.toFixed(2)} m</div>
                <div class="sensor-value">Battery: ${sensors.battery_voltage.toFixed(2)}V (${sensors.battery_percentage.toFixed(1)}%)</div>
                <div class="sensor-value">GPS: ${sensors.satellites} sats</div>
                <div class="sensor-value">Motor 1: ${sensors.motor1}</div>
                <div class="sensor-value">Motor 2: ${sensors.motor2}</div>
                <div class="sensor-value">Motor 3: ${sensors.motor3}</div>
                <div class="sensor-value">Motor 4: ${sensors.motor4}</div>
            `;
        }
        
