sDassana/esp32-flight-controller/archive/legacy_versions/flight_controller.cpp
        function updateControl() {
            document.getElementById('throttle_val').textContent = document.getElementById('throttle').value + '%';
            document.getElementById('roll_val').textContent = document.getElementById('roll').value;
            document.getElementById('pitch_val').textContent = document.getElementById('pitch').value;
            document.getElementById('yaw_val').textContent = document.getElementById('yaw').value;
            
            // Throttle control input updates
            if (controlUpdateTimeout) clearTimeout(controlUpdateTimeout);
            controlUpdateTimeout = setTimeout(() => {
                const data = {
                    throttle: parseFloat(document.getElementById('throttle').value) / 100.0,
                    roll: parseFloat(document.getElementById('roll').value) / 100.0,
                    pitch: parseFloat(document.getElementById('pitch').value) / 100.0,
                    yaw: parseFloat(document.getElementById('yaw').value) / 100.0
                };
                
                fetch('/api/control', {
                    method: 'POST',
                    headers: {'Content-Type': 'application/json'},
                    body: JSON.stringify(data)
                });
            }, 50); // 20Hz update rate
        }
        
        function armMotors() {
            // Safety: Set throttle to 0 before arming
            document.getElementById('throttle').value = 0;
            updateControl();
            
            fetch('/api/arm', {method: 'POST'})
                .then(() => console.log('Arm command sent - throttle set to 0 for safety'));
        }
        
        function disarmMotors() {
            fetch('/api/disarm', {method: 'POST'})
                .then(() => console.log('Disarm command sent'));
        }
        
        function toggleFlightMode() {
            fetch('/api/toggle_mode', {method: 'POST'})
                .then(() => console.log('Mode toggle sent'));
        }
        
        function emergencyStop() {
            if (confirm('EMERGENCY STOP - Are you sure?')) {
                fetch('/api/emergency', {method: 'POST'})
                    .then(() => console.log('Emergency stop activated'));
            }
        }
        
        function updatePID() {
            const pidData = {
                roll_p: parseFloat(document.getElementById('roll_p').value),
                roll_i: parseFloat(document.getElementById('roll_i').value),
                roll_d: parseFloat(document.getElementById('roll_d').value),
                pitch_p: parseFloat(document.getElementById('pitch_p').value),
                pitch_i: parseFloat(document.getElementById('pitch_i').value),
                pitch_d: parseFloat(document.getElementById('pitch_d').value),
                yaw_p: parseFloat(document.getElementById('yaw_p').value),
                yaw_i: parseFloat(document.getElementById('yaw_i').value),
                yaw_d: parseFloat(document.getElementById('yaw_d').value)
            };
            
            fetch('/api/pid_update', {
                method: 'POST',
                headers: {'Content-Type': 'application/json'},
                body: JSON.stringify(pidData)
            });
        }
        
        function updateMotorCal() {
            const motorCalData = {
                motor1_offset: parseFloat(document.getElementById('motor1_offset').value),
                motor2_offset: parseFloat(document.getElementById('motor2_offset').value),
                motor3_offset: parseFloat(document.getElementById('motor3_offset').value),
                motor4_offset: parseFloat(document.getElementById('motor4_offset').value)
            };
            
            fetch('/api/motor_calibration', {
                method: 'POST',
                headers: {'Content-Type': 'application/json'},
                body: JSON.stringify(motorCalData)
            }).then(() => console.log('Motor calibration updated'));
        }
        
        function resetMotorCal() {
            document.getElementById('motor1_offset').value = 0;
            document.getElementById('motor2_offset').value = 0;
            document.getElementById('motor3_offset').value = 0;
            document.getElementById('motor4_offset').value = 0;
            updateMotorCal();
        }
        
        function saveMotorCal() {
            // Save current calibration values (could be expanded to EEPROM storage)
            updateMotorCal();
            alert('Motor calibration saved!');
        }
    </script>
</body>
</html>
)rawliteral";
        server.send(200, "text/html", html); });

    // API: Flight data endpoint
    server.on("/api/flight_data", HTTP_GET, []()
              {
        StaticJsonDocument<1024> doc;
        
        // Flight status
        JsonObject status = doc.createNestedObject("status");
        status["armed"] = flightState.motors_armed;
        status["mode"] = (flightState.mode == MODE_MANUAL) ? "MANUAL" : 
                       (flightState.mode == MODE_STABILIZE) ? "STABILIZE" : "DISARMED";
        status["altitude_hold"] = flightState.altitude_hold_active;
        status["emergency"] = flightState.emergency_stop;
        
        // Sensor data
        JsonObject sensors = doc.createNestedObject("sensors");
        if (xSemaphoreTake(sensorMutex, pdMS_TO_TICKS(10)) == pdTRUE) {
            sensors["roll"] = sensorData.roll_angle;
            sensors["pitch"] = sensorData.pitch_angle;
            sensors["yaw_rate"] = sensorData.yaw_rate;
            sensors["altitude"] = sensorData.altitude_filtered;
            sensors["battery_voltage"] = sensorData.battery_voltage;
            sensors["battery_percentage"] = sensorData.battery_percentage;
            sensors["satellites"] = sensorData.satellites;
            xSemaphoreGive(sensorMutex);
        }
        
        // Motor outputs
        sensors["motor1"] = motorOutputs.motor1;
        sensors["motor2"] = motorOutputs.motor2;
        sensors["motor3"] = motorOutputs.motor3;
        sensors["motor4"] = motorOutputs.motor4;
        
        String response;
        serializeJson(doc, response);
        server.send(200, "application/json", response); });

    // API: Control input endpoint
    server.on("/api/control", HTTP_POST, []()
              {
        if (server.hasArg("plain")) {
            StaticJsonDocument<256> doc;
            deserializeJson(doc, server.arg("plain"));
            
            controlInputs.throttle = doc["throttle"];
            controlInputs.roll = doc["roll"];
            controlInputs.pitch = doc["pitch"];
            controlInputs.yaw = doc["yaw"];
            controlInputs.timestamp = millis();
            
            // Debug control inputs occasionally
            static int control_debug_counter = 0;
            if (++control_debug_counter >= 20) { // Every 20 calls (about 1 second)
                control_debug_counter = 0;
                Serial.printf("Web Control Input - Throttle: %.2f, Roll: %.2f, Pitch: %.2f, Yaw: %.2f\n",
                              controlInputs.throttle, controlInputs.roll, controlInputs.pitch, controlInputs.yaw);
            }
            
            server.send(200, "text/plain", "OK");
        } else {
            server.send(400, "text/plain", "No data");
        } });

    // API: Arm motors
    server.on("/api/arm", HTTP_POST, []()
              {
        Serial.println("ARM button pressed via web interface");
        controlInputs.arm_switch = true;
        controlInputs.timestamp = millis();
        Serial.printf("Control inputs updated - arm_switch: %s, timestamp: %lu\n", 
                     controlInputs.arm_switch ? "true" : "false", 
                     controlInputs.timestamp);
        server.send(200, "text/plain", "Arm command sent"); });

    // API: Disarm motors
    server.on("/api/disarm", HTTP_POST, []()
              {
        Serial.println("DISARM button pressed via web interface");
        controlInputs.arm_switch = false;
        controlInputs.timestamp = millis();
        Serial.printf("Control inputs updated - arm_switch: %s, timestamp: %lu\n", 
                     controlInputs.arm_switch ? "true" : "false", 
                     controlInputs.timestamp);
        server.send(200, "text/plain", "Disarm command sent"); });

    // API: Toggle flight mode
    server.on("/api/toggle_mode", HTTP_POST, []()
              {
        Serial.println("TOGGLE MODE button pressed via web interface");
        controlInputs.mode_switch = !controlInputs.mode_switch;
        controlInputs.timestamp = millis();
        Serial.printf("Mode switch toggled to: %s\n", 
                     controlInputs.mode_switch ? "true" : "false");
        server.send(200, "text/plain", "Mode toggled"); });

